<?php

$result = [
    // 'fd'      => [
    //     'name'     => 'fd',
    //     'title'    => '28浮动',
    //     'subtitle' => '28',
    //     'tools'    => ['ass_he', 'mantissa', 'remainder'],
    //     'too_m'    => 'ass_he',
    //     'model'    => [
    //         'cpt_bet'  => 'bet_basic',
    //         'cpt_chat' => 'chat_basic',
    //         'cpt_log'  => 'keno',
    //         'cpt_win'  => 'keno_he',
    //         'has_opt'  => true,
    //     ],
    //     'auto_ass' => true,
    // ],

    // 'he'      => [
    //     'name'     => 'he',
    //     'title'    => '28固定',
    //     'subtitle' => '28固定',
    //     'tools'    => ['ass_he', 'mantissa', 'remainder'],
    //     'too_m'    => 'ass_he',
    //     'model'    => [
    //         'cpt_bet'  => 'bet_basic',
    //         'cpt_chat' => 'chat_basic',
    //         'cpt_log'  => 'keno',
    //         'cpt_win'  => 'keno_he',
    //         'has_opt'  => true,
    //     ],
    //     'auto_ass' => true,
    // ],

    // 'ww'      => [
    //     'name'  => 'ww',
    //     'title' => '28外围',
    //     'tools' => ['ass_ww'],
    //     'model' => [
    //         'cpt_bet'  => 'keno_ww',
    //         'cpt_chat' => 'chat_basic',
    //         'cpt_log'  => 'keno',
    //         'cpt_win'  => 'keno_he',
    //     ],
    // ],

    // 'st'      => [
    //     'name'     => 'st',
    //     'title'    => '16浮动',
    //     'subtitle' => '16',
    //     'tools'    => ['ass_st', 'mantissa', 'remainder'],
    //     'too_m'    => 'ass_st',
    //     'model'    => [
    //         'cpt_bet'  => 'bet_basic',
    //         'cpt_chat' => 'chat_basic',
    //         'cpt_log'  => 'keno',
    //         'cpt_win'  => 'keno_st',
    //     ],
    //     'auto_ass' => true,
    // ],

    // 'el'      => [
    //     'name'     => 'el',
    //     'title'    => '11浮动',
    //     'subtitle' => '11',
    //     'tools'    => ['ass_el', 'mantissa', 'remainder'],
    //     'too_m'    => 'ass_el',
    //     'model'    => [
    //         'cpt_bet'  => 'bet_basic',
    //         'cpt_chat' => 'chat_basic',
    //         'cpt_log'  => 'keno',
    //         'cpt_win'  => 'keno_el',
    //     ],
    //     'auto_ass' => true,
    // ],

    // 'ts'      => [
    //     'name'     => 'ts',
    //     'title'    => '36',
    //     'subtitle' => '36',
    //     'tools'    => [],
    //     'model'    => [
    //         'cpt_bet'  => 'bet_basic',
    //         'cpt_chat' => 'chat_basic',
    //         'cpt_log'  => 'keno',
    //         'cpt_win'  => 'keno_he',
    //     ],
    //     'auto_ass' => true,
    // ],

    // 'gyh'     => [
    //     'name'     => 'gyh',
    //     'title'    => '冠亚和',
    //     'subtitle' => '冠亚',
    //     'tools'    => ['ass_racing', 'mantissa', 'remainder'],
    //     'too_m'    => 'ass_racing',
    //     'model'    => [
    //         'cpt_bet'  => 'racing_gyh',
    //         'cpt_log'  => 'racing',
    //         'cpt_win'  => 'racing_gyh',
    //         'cpt_chat' => 'chat_basic',
    //     ],
    //     'auto_ass' => true,
    // ],

    // 'cha'     => [
    //     'name'     => 'cha',
    //     'title'    => 'PK冠军',
    //     'subtitle' => '冠军',
    //     'tools'    => ['ass_pk10'],
    //     'too_m'    => 'ass_pk10',
    //     'model'    => [
    //         'cpt_bet'  => 'bet_basic',
    //         'cpt_log'  => 'racing',
    //         'cpt_win'  => 'racing_cha',
    //         'cpt_chat' => 'chat_basic',
    //     ],
    //     'auto_ass' => true,
    // ],

    // 'ptn'     => [
    //     'name'     => 'ptn',
    //     'title'    => 'PK10',
    //     'subtitle' => '10',
    //     'tools'    => ['ass_pk10'],
    //     'too_m'    => 'ass_pk10',
    //     'model'    => [
    //         'cpt_bet'  => 'bet_basic',
    //         'cpt_log'  => 'racing',
    //         'cpt_win'  => 'racing_ptn',
    //         'cpt_chat' => 'chat_basic',
    //     ],
    //     'auto_ass' => true,
    // ],

    // 'ptt'     => [
    //     'name'     => 'ptt',
    //     'title'    => 'PK22',
    //     'subtitle' => '22',
    //     'tools'    => null,
    //     'too_m'    => null,
    //     'model'    => [
    //         'cpt_bet'  => 'bet_basic',
    //         'cpt_log'  => 'racing',
    //         'cpt_win'  => 'racing_ptt',
    //         'cpt_chat' => 'chat_basic',
    //     ],
    //     'auto_ass' => true,
    // ],

    // 'smp'     => [
    //     'name'     => 'smp',
    //     'title'    => '双面盘',
    //     'subtitle' => '双面盘',
    //     'tools'    => null,
    //     'model'    => [
    //         'cpt_bet'  => 'racing_smp',
    //         'cpt_chat' => 'racing_smp',
    //         'cpt_log'  => 'racing',
    //         'cpt_win'  => 'racing',
    //     ],
    // ],

    // 'dwd'     => [
    //     'name'     => 'dwd',
    //     'title'    => '定位胆',
    //     'subtitle' => '定位胆',
    //     'tools'    => null,
    //     'model'    => [
    //         'cpt_bet'  => 'racing_dwd',
    //         'cpt_chat' => 'racing_dwd',
    //         'cpt_log'  => 'racing',
    //         'cpt_win'  => 'racing',
    //     ],
    // ],

    // 'qth'     => [
    //     'name'     => 'qth',
    //     'title'    => '和值',
    //     'subtitle' => '和值',
    //     'tools'    => ['ass_kuai3', 'mantissa', 'remainder'],
    //     'too_m'    => 'ass_kuai3',
    //     'model'    => [
    //         'cpt_bet'  => 'bet_basic',
    //         'cpt_chat' => 'chat_basic',
    //         'cpt_log'  => 'kuai3',
    //         'cpt_win'  => 'kuai3',
    //     ],
    //     'auto_ass' => true,
    // ],

    // 'qzh'     => [
    //     'name'     => 'qzh',
    //     'title'    => '综合',
    //     'subtitle' => '综合',
    //     'tools'    => null,
    //     'model'    => [
    //         'cpt_bet'  => 'kuai3_zh',
    //         'cpt_chat' => 'kuai3_zh',
    //         'cpt_log'  => 'kuai3',
    //         'cpt_win'  => 'kuai3',
    //     ],
    // ],

    // 'ssm'     => [
    //     'name'     => 'ssm',
    //     'title'    => '双面盘',
    //     'subtitle' => '双面盘',
    //     'tools'    => null,
    //     'model'    => [
    //         'cpt_bet'  => 'ssc_ssm',
    //         'cpt_chat' => 'ssc_ssm',
    //         'cpt_log'  => 'shishicai',
    //         'cpt_win'  => 'shishicai',
    //     ],
    // ],

    // 'lhd'     => [
    //     'name'     => 'lhd',
    //     'title'    => '龙虎斗',
    //     'subtitle' => '龙虎斗',
    //     'tools'    => null,
    //     'model'    => [
    //         'cpt_bet'  => 'ssc_lhd',
    //         'cpt_chat' => 'ssc_lhd',
    //         'cpt_log'  => 'shishicai',
    //         'cpt_win'  => 'shishicai',
    //     ],
    // ],

    // 'sdw'     => [
    //     'name'     => 'sdw',
    //     'title'    => '定位胆',
    //     'subtitle' => '定位胆',
    //     'tools'    => null,
    //     'model'    => [
    //         'cpt_bet'  => 'ssc_sdw',
    //         'cpt_chat' => 'ssc_sdw',
    //         'cpt_log'  => 'shishicai',
    //         'cpt_win'  => 'shishicai',
    //     ],
    // ],
    'room1'   => [
        'id'      => 1,
        'name'    => 'room1',
        'title'   => '房间一',
        'dx'      => '1.8',
        'zh1'     => '4.25',
        'zh2'     => '4.65',
        'tools'   => ['ass_he'],
        'is_open' => true,
        'model'   => [
            'cpt_bet'  => 'keno_ww',
            'cpt_chat' => 'chat_basic',
            'cpt_log'  => 'keno',
            'cpt_win'  => 'keno_he',
        ],
        'rules'   => '<p>大/小/单/双:2倍（含本金)</p>
        <p>买小/单，开奖13且总下注大于1000: 1.8倍（含本金)</p>
        <p>买小/单，开奖13且总下注小于1000: 1.8倍（含本金)</p>
        <p>买大/双，开奖14且总下注大于1000: 1.8倍（含本金)</p>
        <p>买大/双，开奖14且总下注小于1000: 1.8倍（含本金)</p>
        <p>小单/大双： 4.65倍(含本金)</p>
        <p>小双/大单： 4.65倍(含本金)</p>
        <p>买组合开奖结果为13/14 中奖回本</p><p>极大/极小：15倍(含本金)</p>
        <p>对子：3.2倍(含本金)</p><p>顺子：14倍(含本金)</p><p>豹子：66倍(含本金)</p><p>龙/虎/豹：2.92倍(含本金)</p><p>龙号码：00/03/06/09/12/15/18/21/24/27</p><p>虎号码：01/04/07/10/13/16/19/22/25</p><p>豹号码：02/05/08/11/14/17/20/23/26</p>
        <p>总注最高限额：300000</p>
        <p>中奖最高限额：200000</p>
        <p>大/小/单/双：100000封顶    组合：30000封顶</p>
        <p>极大/极小：10000封顶</p>
        <p>数字 00/27:1000封顶   数字01/26:2000封顶</p>
        <p>数字 02/25:5000封顶   其他数字:10000封顶</p>
        <p>对子：30000封顶   顺子:10000封顶</p>
        <p>豹子：2000封顶</p>
        <p>龙：10000封顶   虎:10000封顶</p>
        <p>豹：10000封顶 </p>
         <h5>返点规则1.(不含2.8玩法/3.2玩法)</h5>
         <p>1：5期投注以上且100流水起计算返点</p>
         <p>2：流水低于2w,返点减少0.1%</p>
         <p>3：大小单双、龙虎豹投注超过80%返点减少0.1%</p>
         <p>4：大小单双、龙虎豹投注超过90%返点减少0.2%</p>
         <p>5：组合投注超过90%或杀组合投注比例超过70%，</p>
         <p>返点减少0.2%</p>
         <p>6：平推投注返点减少0.2%</p>
         <p>7：刷水套利（0容忍，秒封账号）</p>
         <h5>返点规则2.(2.8玩法/3.2玩法)</h5>
         <p>1：5期投注以上且100流水起计算返点。</p>
         <p>2：流水低于2w，返点减少0.1%</p>
         <p>3：大小单双投注超过80%，返点扣0.1%</p>
         <p>4：对压达到70%或平推下注，返点扣0.2%</p>
         <p>5：刷水套利（0容忍，秒封账号）</p>

        ',
    ],
    'room2'   => [
        'id'      => 2,
        'name'    => 'room2',
        'dx'      => '1.88',
        'zh1'     => '4.25',
        'zh2'     => '4.65',
        'title'   => '房间二',
        'tools'   => ['ass_he'],
        'is_open' => true,
        'model'   => [
            'cpt_bet'  => 'keno_ww',
            'cpt_chat' => 'chat_basic',
            'cpt_log'  => 'keno',
            'cpt_win'  => 'keno_he',
        ],
        'rules'   => '
        <p>大/小/单/双：2倍(含本金)</p>
        <p>买大或双，总下注大于50000 开奖结果为14，==1.8倍(含本金)</p>
        <p>买小或单，总下注大于50000 开奖结果为13，==1.8倍(含本金)</p>
        <p>买大或双，总下注小于等于50000 开奖结果为14，==1.88倍(含本金)</p>
        <p>买小或单，总下注小于等于50000 开奖结果为13，==1.88倍(含本金)</p>
        <p>小单/大双：4.65倍(含本金)</p>
        <p>小双/大单：4.25倍(含本金)</p>
        <p>买组合开奖结果为13/14中奖回本</p>
        <p>极大/极小：15倍(含本金)</p>
        <p>对子：3.2倍(含本金)</p>
        <p>顺子：14倍(含本金)</p>
        <p>豹子：66倍(含本金)</p>
        <p>龙/虎/豹：2.92倍(含本金)</p>
        <p>龙号码：00/03/06/09/12/15/18/21/24/27</p>
        <p>虎号码：01/04/07/10/13/16/19/22/25</p>
        <p>豹号码：02/05/08/11/14/17/20/23/26</p>
        <p>总注最高限额：300000</p>
        <p>中奖最高限额：200000</p>
        <p>大/小/单/双：100000封顶    组合：30000封顶</p>
        <p>极大/极小：10000封顶</p>
        <p>数字 00/27:1000封顶   数字01/26:2000封顶</p>
        <p>数字 02/25:5000封顶   其他数字:10000封顶</p>
        <p>对子：30000封顶   顺子:10000封顶</p>
        <p>豹子：2000封顶</p>
        <p>龙：10000封顶   虎:10000封顶</p>
        <p>豹：10000封顶 </p>
        <h5>返点规则1.(不含2.8玩法/3.2玩法)</h5>
        <p>1：5期投注以上且100流水起计算返点</p>
        <p>2：流水低于2w,返点减少0.1%</p>
        <p>3：大小单双、龙虎豹投注超过80%返点减少0.1%</p>
        <p>4：大小单双、龙虎豹投注超过90%返点减少0.2%</p>
        <p>5：组合投注超过90%或杀组合投注比例超过70%，</p>
        <p>返点减少0.2%</p>
        <p>6：平推投注返点减少0.2%</p>
        <p>7：刷水套利（0容忍，秒封账号）</p>
        <h5>返点规则2.(2.8玩法/3.2玩法)</h5>
        <p>1：5期投注以上且100流水起计算返点。</p>
        <p>2：流水低于2w，返点减少0.1%</p>
        <p>3：大小单双投注超过80%，返点扣0.1%</p>
        <p>4：对压达到70%或平推下注，返点扣0.2%</p>
        <p>5：刷水套利（0容忍，秒封账号）</p>
        ',
    ],
    'room3'   => [
        'id'      => 3,
        'name'    => 'room3',
        'dx'      => '2.0',
        'zh1'     => '4.25',
        'zh2'     => '4.65',
        'title'   => '房间三',
        'is_open' => true,
        'tools'   => ['ass_he'],
        'model'   => [
            'cpt_bet'  => 'keno_ww',
            'cpt_chat' => 'chat_basic',
            'cpt_log'  => 'keno',
            'cpt_win'  => 'keno_he',
        ],
        'rules'   => '
        <p>大/小/单/双：2.0倍(含本金)</p>
        <p>组合： 小单/大双 4.65倍(含本金)</p>
        <p>组合： 小双/大单 4.25倍(含本金)</p>
        <p>1.买小/单或大/双：开13/14=1.6倍(含本金)</p>
        <p>2.买组合小单/大双： 开13/14回本</p>
        <p>极大/极小:15倍(含本金)</p>
        <p>对子：3.2倍(含本金)</p>
        <p>顺子：14倍(含本金)</p>
        <p>豹子：66倍(含本金)</p>
        <p>龙/虎/豹：2.92倍(含本金)</p>
        <p>龙号码：00/03/06/09/12/15/18/21/24/27</p>
        <p>虎号码：01/04/07/10/13/16/19/22/25</p>
        <p>豹号码：02/05/08/11/14/17/20/23/26</p>
        <p>总注最高限额：300000</p>
        <p>中奖最高限额：200000</p>
        <p>大/小/单/双：100000封顶    组合：30000封顶</p>
        <p>极大/极小：10000封顶</p>
        <p>数字 00/27:1000封顶   数字01/26:2000封顶</p>
        <p>数字 02/25:5000封顶   其他数字:10000封顶</p>
        <p>对子：30000封顶   顺子:10000封顶</p>
        <p>豹子：2000封顶</p>
        <p>龙：10000封顶   虎:10000封顶</p>
        <p>豹：10000封顶 </p>
        <h5>返点规则1.(不含2.8玩法/3.2玩法)</h5>
        <p>1：5期投注以上且100流水起计算返点</p>
        <p>2：流水低于2w,返点减少0.1%</p>
        <p>3：大小单双、龙虎豹投注超过80%返点减少0.1%</p>
        <p>4：大小单双、龙虎豹投注超过90%返点减少0.2%</p>
        <p>5：组合投注超过90%或杀组合投注比例超过70%，</p>
        <p>返点减少0.2%</p>
        <p>6：平推投注返点减少0.2%</p>
        <p>7：刷水套利（0容忍，秒封账号）</p>
        <h5>返点规则2.(2.8玩法/3.2玩法)</h5>
        <p>1：5期投注以上且100流水起计算返点。</p>
        <p>2：流水低于2w，返点减少0.1%</p>
        <p>3：大小单双投注超过80%，返点扣0.1%</p>
        <p>4：对压达到70%或平推下注，返点扣0.2%</p>
        <p>5：刷水套利（0容忍，秒封账号）</p>
        ',
    ],
    'room4'   => [
        'id'      => 4,
        'name'    => 'room4',
        'dx'      => '2.0',
        'zh1'     => '4.25',
        'zh2'     => '5',
        'title'   => '房间四',
        'is_open' => true,
        'tools'   => ['ass_he'],
        'model'   => [
            'cpt_bet'  => 'keno_ww',
            'cpt_chat' => 'chat_basic',
            'cpt_log'  => 'keno',
            'cpt_win'  => 'keno_he',
        ],
        'rules'   => '
        <p>大小单双:2.0倍(含本金)</p>
        <p>组合: 小单/大双 5.0倍(含本金)</p>
        <p>组合: 小双/大单 4.2倍(含本金)</p>
        <p>1.买小/单或大/双：开13/14=1.6倍(含本金)</p>
        <p>2.买组合小单/大双：开13/14通杀</p>
        <p>极大/极小:15倍(含本金)</p>
        <p>对子：3.2倍(含本金)</p>
        <p>顺子：14倍(含本金)</p>
        <p>豹子：66倍(含本金)</p>
        <p>龙/虎/豹：2.92倍(含本金)</p>
        <p>龙号码：00/03/06/09/12/15/18/21/24/27</p>
        <p>虎号码：01/04/07/10/13/16/19/22/25</p>
        <p>豹号码：02/05/08/11/14/17/20/23/26</p>
        <p>总注最高限额：300000</p>
        <p>中奖最高限额：200000</p>
        <p>大/小/单/双：100000封顶    组合：30000封顶</p>
        <p>极大/极小：10000封顶</p>
        <p>数字 00/27:1000封顶   数字01/26:2000封顶</p>
        <p>数字 02/25:5000封顶   其他数字:10000封顶</p>
        <p>对子：30000封顶   顺子:10000封顶</p>
        <p>豹子：2000封顶</p>
        <p>龙：10000封顶   虎:10000封顶</p>
        <p>豹：10000封顶 </p>
        <h5>返点规则1.(不含2.8玩法/3.2玩法)</h5>
        <p>1：5期投注以上且100流水起计算返点</p>
        <p>2：流水低于2w,返点减少0.1%</p>
        <p>3：大小单双、龙虎豹投注超过80%返点减少0.1%</p>
        <p>4：大小单双、龙虎豹投注超过90%返点减少0.2%</p>
        <p>5：组合投注超过90%或杀组合投注比例超过70%，</p>
        <p>返点减少0.2%</p>
        <p>6：平推投注返点减少0.2%</p>
        <p>7：刷水套利（0容忍，秒封账号）</p>
        <h5>返点规则2.(2.8玩法/3.2玩法)</h5>
        <p>1：5期投注以上且100流水起计算返点。</p>
        <p>2：流水低于2w，返点减少0.1%</p>
        <p>3：大小单双投注超过80%，返点扣0.1%</p>
        <p>4：对压达到70%或平推下注，返点扣0.2%</p>
        <p>5：刷水套利（0容忍，秒封账号）</p>
        ',
    ],
    'room5'   => [
        'id'      => 5,
        'name'    => 'room5',
        'dx'      => '2.8',
        'zh1'     => '6.0',
        'zh2'     => '6.0',
        'title'   => '房间五',
        'is_open' => true,
        'tools'   => ['ass_he'],
        'model'   => [
            'cpt_bet'  => 'keno_ww',
            'cpt_chat' => 'chat_basic',
            'cpt_log'  => 'keno',
            'cpt_win'  => 'keno_he',
        ],
        'rules'   => '
        <p>大/小/单/双 ：2.8倍(含本金)</p>
        <p>小单/大双 ：6倍(含本金)</p>
        <p>小双/大单 ：6倍(含本金)</p>
        <p>开13/14 （对子/顺子/豹子） 大/小/单/双及组合回本 </p>
        <p>极大/极小:15倍(含本金)</p>
        <p>对子：3.2倍(含本金)</p>
        <p>顺子：14倍(含本金)</p>
        <p>豹子：66倍(含本金)</p>
        <p>龙/虎/豹：2.92倍(含本金)</p>
        <p>龙号码：00/03/06/09/12/15/18/21/24/27</p>
        <p>虎号码：01/04/07/10/13/16/19/22/25</p>
        <p>豹号码：02/05/08/11/14/17/20/23/26</p>
        <p>总注最高限额：300000</p>
        <p>中奖最高限额：200000</p>
        <p>大/小/单/双：100000封顶    组合：30000封顶</p>
        <p>极大/极小：10000封顶</p>
        <p>数字 00/27:1000封顶   数字01/26:2000封顶</p>
        <p>数字 02/25:5000封顶   其他数字:10000封顶</p>
        <p>对子：30000封顶   顺子:10000封顶</p>
        <p>豹子：2000封顶</p>
        <p>龙：10000封顶   虎:10000封顶</p>
        <p>豹：10000封顶 </p>
        <h5>返点规则1.(不含2.8玩法/3.2玩法)</h5>
        <p>1：5期投注以上且100流水起计算返点</p>
        <p>2：流水低于2w,返点减少0.1%</p>
        <p>3：大小单双、龙虎豹投注超过80%返点减少0.1%</p>
        <p>4：大小单双、龙虎豹投注超过90%返点减少0.2%</p>
        <p>5：组合投注超过90%或杀组合投注比例超过70%，</p>
        <p>返点减少0.2%</p>
        <p>6：平推投注返点减少0.2%</p>
        <p>7：刷水套利（0容忍，秒封账号）</p>
        <h5>返点规则2.(2.8玩法/3.2玩法)</h5>
        <p>1：5期投注以上且100流水起计算返点。</p>
        <p>2：流水低于2w，返点减少0.1%</p>
        <p>3：大小单双投注超过80%，返点扣0.1%</p>
        <p>4：对压达到70%或平推下注，返点扣0.2%</p>
        <p>5：刷水套利（0容忍，秒封账号）</p>
        ',
    ],
    'room6'   => [
        'id'      => 6,
        'name'    => 'room6',
        'dx'      => '3.2',
        'zh1'     => '6.5',
        'zh2'     => '7.0',
        'title'   => '房间六',
        'tools'   => ['ass_he'],
        'is_open' => true,
        'model'   => [
            'cpt_bet'  => 'keno_ww',
            'cpt_chat' => 'chat_basic',
            'cpt_log'  => 'keno',
            'cpt_win'  => 'keno_he',
        ],
        'rules'   => '
           <p>大/小/单/双：3.2倍(含本金)</p>
           <p>大单/小双：6.5倍(含本金)</p>
           <p>小单/大双：7.0倍(含本金)</p>
           <p>前三位数字含0或9视为回本，中单注/组合 回本</p>
           <p>如：0+7+8=15(回本)， 9+4+5=18(回本)</p>
           <p>小/单/小单 开奖结果为13，回本</p>
           <p>大/双/大双 开奖结果为14，回本</p>
           <p>中单注/组合，开奖结果为对子/顺子/豹子不回本，照赔</p>
           <p>对子：3.2倍(含本金)</p>
           <p>中对子，开奖结果为13 回本</p>
           <p>中对子，开奖结果为14 回本</p>
           <p>极大/极小:15倍(含本金)</p>
        <p>顺子：14倍(含本金)</p>
        <p>豹子：66倍(含本金)</p>
        <p>龙/虎/豹：2.92倍(含本金)</p>
        <p>龙号码：00/03/06/09/12/15/18/21/24/27</p>
        <p>虎号码：01/04/07/10/13/16/19/22/25</p>
        <p>豹号码：02/05/08/11/14/17/20/23/26</p>
        <p>总注最高限额：300000</p>
        <p>中奖最高限额：200000</p>
        <p>大/小/单/双：100000封顶    组合：30000封顶</p>
        <p>极大/极小：10000封顶</p>
        <p>数字 00/27:1000封顶   数字01/26:2000封顶</p>
        <p>数字 02/25:5000封顶   其他数字:10000封顶</p>
        <p>对子：30000封顶   顺子:10000封顶</p>
        <p>豹子：2000封顶</p>
        <p>龙：10000封顶   虎:10000封顶</p>
        <p>豹：10000封顶 </p>
        <h5>返点规则1.(不含2.8玩法/3.2玩法)</h5>
        <p>1：5期投注以上且100流水起计算返点</p>
        <p>2：流水低于2w,返点减少0.1%</p>
        <p>3：大小单双、龙虎豹投注超过80%返点减少0.1%</p>
        <p>4：大小单双、龙虎豹投注超过90%返点减少0.2%</p>
        <p>5：组合投注超过90%或杀组合投注比例超过70%，</p>
        <p>返点减少0.2%</p>
        <p>6：平推投注返点减少0.2%</p>
        <p>7：刷水套利（0容忍，秒封账号）</p>
        <h5>返点规则2.(2.8玩法/3.2玩法)</h5>
        <p>1：5期投注以上且100流水起计算返点。</p>
        <p>2：流水低于2w，返点减少0.1%</p>
        <p>3：大小单双投注超过80%，返点扣0.1%</p>
        <p>4：对压达到70%或平推下注，返点扣0.2%</p>
        <p>5：刷水套利（0容忍，秒封账号）</p>
        ',
    ],
    'room7'   => [
        'id'      => 7,
        'name'    => 'room7',
        'dx'      => '2.3',
        'zh1'     => '4.5',
        'zh2'     => '5.5',
        'title'   => '房间七',
        'is_open' => true,
        'tools'   => ['ass_he'],
        'model'   => [
            'cpt_bet'  => 'keno_ww',
            'cpt_chat' => 'chat_basic',
            'cpt_log'  => 'keno',
            'cpt_win'  => 'keno_he',
        ],
        'rules'   => '
        <p>大/小/单/双 2.3倍(开豹子/对子时回本)</p>
        <p>小双/大单 5.5倍(开豹子/对子时回本)</p>
        <p>小单/大双 4.5倍(开豹子/对子时回本)</p>
        <p>本倍场单期只能下注2个组合</p>
        <p>极大/极小:15倍(含本金)</p>
        <p>对子：3.2倍(含本金)</p>
        <p>顺子：14倍(含本金)</p>
        <p>豹子：66倍(含本金)</p>
        <p>龙/虎/豹：2.92倍(含本金)</p>
        <p>龙号码：00/03/06/09/12/15/18/21/24/27</p>
        <p>虎号码：01/04/07/10/13/16/19/22/25</p>
        <p>豹号码：02/05/08/11/14/17/20/23/26</p>
        <p>总注最高限额：300000</p>
        <p>中奖最高限额：200000</p>
        <p>大/小/单/双：100000封顶    组合：30000封顶</p>
        <p>极大/极小：10000封顶</p>
        <p>数字 00/27:1000封顶   数字01/26:2000封顶</p>
        <p>数字 02/25:5000封顶   其他数字:10000封顶</p>
        <p>对子：30000封顶   顺子:10000封顶</p>
        <p>豹子：2000封顶</p>
        <p>龙：10000封顶   虎:10000封顶</p>
        <p>豹：10000封顶 </p>
        <h5>返点规则1.(不含2.8玩法/3.2玩法)</h5>
        <p>1：5期投注以上且100流水起计算返点</p>
        <p>2：流水低于2w,返点减少0.1%</p>
        <p>3：大小单双、龙虎豹投注超过80%返点减少0.1%</p>
        <p>4：大小单双、龙虎豹投注超过90%返点减少0.2%</p>
        <p>5：组合投注超过90%或杀组合投注比例超过70%，</p>
        <p>返点减少0.2%</p>
        <p>6：平推投注返点减少0.2%</p>
        <p>7：刷水套利（0容忍，秒封账号）</p>
        <h5>返点规则2.(2.8玩法/3.2玩法)</h5>
        <p>1：5期投注以上且100流水起计算返点。</p>
        <p>2：流水低于2w，返点减少0.1%</p>
        <p>3：大小单双投注超过80%，返点扣0.1%</p>
        <p>4：对压达到70%或平推下注，返点扣0.2%</p>
        <p>5：刷水套利（0容忍，秒封账号）</p>
        ',
    ],
    'room8'   => [
        'id'      => 8,
        'name'    => 'room8',
        'dx'      => '2.3',
        'zh1'     => '4.8',
        'zh2'     => '5.9',
        'title'   => '房间八',
        'tools'   => ['ass_he'],
        'is_open' => true,
        'model'   => [
            'cpt_bet'  => 'keno_ww',
            'cpt_chat' => 'chat_basic',
            'cpt_log'  => 'keno',
            'cpt_win'  => 'keno_he',
        ],
        'rules'   => '
        <p>大/小/单/双 2.3倍(开豹子/对子时回本)</p>
        <p>小双/大单 5.9倍(开豹子/对子时通杀)</p>
        <p>小单/大双 4.8倍(开豹子/对子时通杀)</p>
        <p>本倍场单期只能下注2个组合</p>
        <p>极大/极小:15倍(含本金)</p>
        <p>对子：3.2倍(含本金)</p>
        <p>顺子：14倍(含本金)</p>
        <p>豹子：66倍(含本金)</p>
        <p>龙/虎/豹：2.92倍(含本金)</p>
        <p>龙号码：00/03/06/09/12/15/18/21/24/27</p>
        <p>虎号码：01/04/07/10/13/16/19/22/25</p>
        <p>豹号码：02/05/08/11/14/17/20/23/26</p>
        <p>总注最高限额：300000</p>
        <p>中奖最高限额：200000</p>
        <p>大/小/单/双：100000封顶    组合：30000封顶</p>
        <p>极大/极小：10000封顶</p>
        <p>数字 00/27:1000封顶   数字01/26:2000封顶</p>
        <p>数字 02/25:5000封顶   其他数字:10000封顶</p>
        <p>对子：30000封顶   顺子:10000封顶</p>
        <p>豹子：2000封顶</p>
        <p>龙：10000封顶   虎:10000封顶</p>
        <p>豹：10000封顶 </p>
        <h5>返点规则1.(不含2.8玩法/3.2玩法)</h5>
        <p>1：5期投注以上且100流水起计算返点</p>
        <p>2：流水低于2w,返点减少0.1%</p>
        <p>3：大小单双、龙虎豹投注超过80%返点减少0.1%</p>
        <p>4：大小单双、龙虎豹投注超过90%返点减少0.2%</p>
        <p>5：组合投注超过90%或杀组合投注比例超过70%，</p>
        <p>返点减少0.2%</p>
        <p>6：平推投注返点减少0.2%</p>
        <p>7：刷水套利（0容忍，秒封账号）</p>
        <h5>返点规则2.(2.8玩法/3.2玩法)</h5>
        <p>1：5期投注以上且100流水起计算返点。</p>
        <p>2：流水低于2w，返点减少0.1%</p>
        <p>3：大小单双投注超过80%，返点扣0.1%</p>
        <p>4：对压达到70%或平推下注，返点扣0.2%</p>
        <p>5：刷水套利（0容忍，秒封账号）</p>',
    ],
    'number'  => [
        'name'  => 'number',
        'title' => '数字模式',
        'tools' => ['ass_he'],
        'model' => [
            'cpt_bet'  => 'keno_ww',
            'cpt_chat' => 'chat_basic',
            'cpt_log'  => 'keno',
            'cpt_win'  => 'keno_he',
        ],
    ],
    'special' => [
        'name'  => 'special',
        'title' => '特殊玩法',
        'tools' => ['ass_he'],
        'model' => [
            'cpt_bet'  => 'keno_ww',
            'cpt_chat' => 'chat_basic',
            'cpt_log'  => 'keno',
            'cpt_win'  => 'keno_he',
        ],
    ],
    //特殊玩法

];

$lotto28 = config('lotto._lotto28.bet_places');
// $pk10      = config('lotto._pk10.bet_places');
// $kuai3     = config('lotto._kuai3.bet_places');
// $shishicai = config('lotto._shishicai.bet_places');
//$places = array_merge($lotto28, $pk10, $kuai3, $shishicai);
$places = $lotto28;

foreach ($places as $value) {
    $group = $value['group'];
    $place = $value['place'];
    unset($value['group']);
    $result[$group]['place'][$place] = $value;
}

return $result;
